#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.main: Refreshing state... [id=8d5d7824c953355f1d790cca481d864ed11ae63f]
data.azurerm_resource_group.example: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mZjkzZGVjNi04N2I2LTQ4OWQtODM5ZC0yY2E5NTFiMmI2ZGE7b2JqZWN0SWQ9ZjFhOTAxZTYtOGVmMC00ZGExLTg4YTMtODE3MzA2ZTk4MjM2O3N1YnNjcmlwdGlvbklkPTU1ZmJmMGUyLTVkNDItNGU2MS05ZGJjLWYwZjk4MWNmNWQzOTt0ZW5hbnRJZD0xNmIzYzAxMy1kMzAwLTQ2OGQtYWM2NC03ZWRhMDgyMGI2ZDM=]
data.azurerm_resource_group.example: Read complete after 0s [id=/subscriptions/55fbf0e2-5d42-4e61-9dbc-f0f981cf5d39/resourceGroups/ZC-20230705-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/55fbf0e2-5d42-4e61-9dbc-f0f981cf5d39/resourceGroups/ZC-20230705-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/55fbf0e2-5d42-4e61-9dbc-f0f981cf5d39/resourceGroups/ZC-20230705-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/55fbf0e2-5d42-4e61-9dbc-f0f981cf5d39/resourceGroups/ZC-20230705-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/55fbf0e2-5d42-4e61-9dbc-f0f981cf5d39/resourceGroups/ZC-20230705-dev/providers/Microsoft.Compute/virtualMachines/example-machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example must be replaced
-/+ resource "azurerm_linux_virtual_machine" "example" {
      ~ computer_name                   = "example-machine" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/55fbf0e2-5d42-4e61-9dbc-f0f981cf5d39/resourceGroups/ZC-20230705-dev/providers/Microsoft.Compute/virtualMachines/example-machine" -> (known after apply)
      ~ name                            = "example-machine" -> "example-machine-pr" # forces replacement
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - tags                            = {} -> null
      ~ virtual_machine_id              = "58f48d2c-e380-4dce-a89c-fa7cc749d721" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (14 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "example-machine_OsDisk_1_4c6d7c2b46a246a9ae0aa8a38917586d" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @zaracheema, Action: `pull_request`*